Notas-de-clase/clase-20220817.md

# &Iacute;ndice

1.  [Estructuras de datos](#orgc74c8d4)
    1.  [Estructura de control](#orge5c6455)
        1.  [Lineas o secuencias](#org2cb026d)
        2.  [No lineales](#org6617152)
    2.  [Estructura de datos](#orgc911f63)
        1.  [Estructuras de datos estáticas](#org462c0d3)
        2.  [Estructuras Dinámicas](#orgc11a94d)
        3.  [Tarea 1](#org62087e7)
        4.  [¿Qué es una estructura de datos?](#orgb4cd262)



<a id="orgc74c8d4"></a>

# Estructuras de datos


<a id="orge5c6455"></a>

## Estructura de control


<a id="org2cb026d"></a>

### Lineas o secuencias

-   Entrada de datos
-   Salida de datos
-   Asignaciones


<a id="org6617152"></a>

### No lineales

-   Estructuas de selección
    -   if
    -   if/else
    -   if anidado
    -   switch/case
-   repetición
    -   for: Estructuras estáticas numéricas
    -   while: Utilizado cuando
    -   do/while: Validaciones y procesos que se hacen al menos una vez


<a id="orgc911f63"></a>

## Estructura de datos

Una forma de organizar datos—como un conjunto—elementales con el objetivo de facilitar la manipulación de estos datos como un todo o individual y conjunto de operaciones


<a id="org462c0d3"></a>

### Estructuras de datos estáticas

El espacio de memoria de los datos se definen en su diseño y su memoria no aumenta en el tiempo de ejecución.

-   Arreglos numéricos
    -   Una dimensión -> Vector
    -   Dos dimensiones -> Matriz
    -   Tres dimensiones -> Tabla
    -   N dimensiones -> Simplex
-   Cadenas de caractéres
-   Arreglos de cadenas de caractéres
-   Struct (registros)
    -   Arreglo de structs
    -   Funciones
    -   Punteros
    -   Archivos


<a id="orgc11a94d"></a>

### Estructuras Dinámicas

El espacio de memoria se empieza a generar al momento de ejecutar el programa.

-   Lineales
    -   Listas encadenadas
    -   Pilas
    -   Colas
-   No lineales
    -   Arboles
    -   Grafos
-   Recursividad
-   Ordenación y búsqueda


<a id="org62087e7"></a>

### Tarea 1

-   Aignación dinámica de memoria
    -   malloc()
    -   calloc()
    -   new()
-   struct()
-   typedef struct() (investigar en dónde se usa cada una).


<a id="orgb4cd262"></a>

### ¿Qué es una estructura de datos?

Forma de organizar un conjunto de datos elementales (un dato elemental es la mínima información que se tiene en el sistema) con el objetivo de facilitar la manipulación de estos datos como un todo o individualmente.

Define la rognaziación de interrelacionamiento de estos, y un conjunto de operaciones que se pueden realizar sobre él.

Las operaciones báscias:

-   Alta
-   Baja
-   Búsqueda
-   Ordenamiento
-   Apareo (JOIN)

Tipos de estructuas de datos

-   Pilas
-   Colas y listas
-   Árboles
-   Grafos
-   Arreglos
-   Tablas Hash
-   Montículos
-   Registros

